Repository: Lilium27/Creating-Intelligent-Content-with-Lightweight-DITA-Translation-Project
Catalog: omegat/project_save.tmx
Source language: en
Languages: zh_cn

source: Preformatted text: content that includes line breaks and spaces that should be preserved when rendered.
zh_cn: 预格式化文本（preformatted text:）：包含换行符和空格的内容，这些格式在呈现时应该保留。

source: Prelli explains rhetorical topoi as “headings or topics that identify lines of thought.” He adds that “some of these lines of development are relevant to virtually all discussion within a culture; others are peculiar to specific subjects and fields of inquiry” (Prelli, 1989, p.
zh_cn: 普雷利将修辞性主题解释为“确定思路的标题或话题。” 他补充到“其中一些发展思路与文化中几乎所有的讨论都有关；其他的则是特定学科和研究领域所特有的"(Prelli, 1989, p.

source: Price also included a whole chapter dedicated to “Creating Computer- Assisted Instruction.” When he compared online documentation to its printed version, he claimed that “people find them friendlier (At least it can be friendlier.
zh_cn: 普莱斯书中还有一整章都在致力于“创建计算机辅助教学。”当他将在线文档和纸质文档进行比较时，他声称“人们发现在线文档更友好(至少它们可以变得更友好。”

source: Price was a senior technical writer at Apple, and described the book as related to organizational practices,
zh_cn: 普莱斯是苹果公司的高级技术作家，他说这本书与组织实践有关，

source: Price's conventions and recommendations were presented with the ultimate goal of creating “friendly manuals,” which the author posited as the antidote against bad manuals of the past.
zh_cn: 普莱斯提出的惯例和建议的最终目的是创造“友好的手册”，作者将其作为解救过去糟糕手册的一剂良药。

source: Price's discussion of online deliverables advanced the conversation on topic-based authoring that moved away from the traditional manual-as-book model that dominated the market in the 1970s and before.
zh_cn: 普莱斯对在线可交付内容的讨论推动了基于主题的创作的讨论，而后者已经从20世纪70年代及以前占据市场的传统书籍式手册中脱离出来。

source: Price's emphasis on task-orientation established some topical moves that still apply to tutorial/procedural content, with the overall recommendation of focusing on organization.
zh_cn: 普莱斯强调任务导向，创建了一些主题文步，这些文步现仍可以用于教程型/流程型内容，并提出了关注组织架构的整体性建议。

source: Price's separation of a manual's text into content types establishes a distinction between tutorial (“offers step-by-step training focused on a particular activity”) and reference (“offers procedures that users can apply in many different circumstances”) writing conventions.
zh_cn: 普莱斯将手册的文本划分成不同的内容类型，在教程型（“针对特定活动提供逐步培训”）和参考型（“提供用户多个不同场景下采用的流程”）写作惯例间做了区分

source: Priestley and I continued collecting data for our HDITA authoring research project.
zh_cn: 我和普里斯特利一直在为 HDITA 写作研究项目收集数据。

source: Priestley and I started a research project that introduced Virginia Tech students to a DITA-like authoring and publishing environment without XML.
zh_cn: 普里斯特利和我开展了一个研究项目，向弗吉尼亚理工大学的学生介绍一个不用 XML 的类 DITA 的写作和发布环境。

source: Priestley and his co-authors addressed the evolution of the manual as it became a collection of topics with “fine-grained” moves to signal or tag specific conventions:
zh_cn: 普里斯特利和他的合著者讨论了手册的演变，它变成了一个主题集合，用“细粒度”文步来标志或标记特定惯例：

source: Priestley had been working with a group from the IBM Cloud project (then called Bluemix), which used Markdown for its documentation and needed to implement DITA-like reuse and transclusion features.
zh_cn: 普里斯特利曾与 IBM Cloud 项目（当时称为 Bluemix）的一个团队合作，该团队使用 Markdown 编写文档，需要实现类 DITA 的复用和引用功能。

source: Priestley has mentioned on many occasions the impact and influence of Carroll's work on DITA and LwDITA.
zh_cn: 普利斯特利在多个场合都曾提及卡罗尔在DITA和轻量级DITA上的工作所产生的巨大影响。

source: Priestley introduced the proposal by saying that:
zh_cn: 普里斯特利介绍这个提议时说：

source: Priestley is quoted saying: “In IBM, some folks hate DITA, and they don't even want to use (Microsoft) Word, but (prefer) simple web forms or Markdown syntax.” He added that including Markdown in Lightweight DITA could open up “opportunities in both directions, (as it) provides (an) integration point against (the) whole corporate content spectrum” (DITA Technical Committee, 2014).
zh_cn: 记录里记载了普里斯特利说的话：“在 IBM，有些人讨厌 DITA，甚至不想用（微软的）Word，而（更喜欢）简单的网页表单或 Markdown 语法。”他还说，在轻量级 DITA中 包括 Markdown 可能会打开“两个方向的机会，（因为） Markdown 是公司所有内容的集成点”（DITA 技术委员会，2014年）。

source: Priestley opened with a general introduction to LwDITA and XDITA, I followed with some HDITA examples and usage scenarios, and Ai showed a preliminary approach for creating DITA-like content in JSON.
zh_cn: 作为开场，普里斯特利对 LwDITA 和 XDITA 做了简单介绍，我接着介绍了一些 HDITA 示例和使用场景，艾路展示了如何用 JSON 创建类 DITA 的内容。

source: Priestley pointed out that the simplified map had 6 elements (5 if the <topicref> element was modified to include a title).
zh_cn: 普里斯特利指出简化后的地图有6 个元素（如果 <topicref> 元素包含标题的话，则为5个)。

source: Priestley questioned if including DITA in the name would be “a help or a hindrance for adoption” (Priestley, 2014b).
zh_cn: 普里斯特利对在名字中加入“DITA”一词是会“促进使用还是阻碍使用”存有疑虑（普里斯特利，2014年）。

source: Priestley remembers that, a few years ago, someone questioned on a practitioner's blog if DITA was indeed a product of minimalism applied to technical instruction.
zh_cn: 普里斯特利还记得，就在几年前，还有人在从业者的博客下质疑DITA是否真的是极简主义应用于技术说明的产物。

source: Priestley's basic topic appears on Figure 3.1.
zh_cn: 基于Priestley提案的基本话题如图3.1所示。

source: Priestley's proposal emphasized that the lightweight topic only included 16 elements, and that all attributes, with the exception of @id on <topic>, were optional.
zh_cn: 普里斯特利的提案强调轻量级话题只包含16 个元素，除了<topic>上的@id 属性之外，所有属性都是可选的。

source: Priestley's revised catalog of lightweight topics expanded from the one “strawman” topic and in the revised version included the following:
zh_cn: 普里斯特利修订的轻量级话题从“稻草人”话题扩展而来，修订后的版本中包括了以下内容：

source: Processing and reporting.
zh_cn: 处理和报告.

source: Production editors, who will get involved in defining the transformation files that assign formatting based on structure.
zh_cn: 生产编辑，基于文档结构参与编写定义格式的转换文件

source: Professional authoring tools can hide code in What You See Is What You Get (WYSIWYG) options, but the rhetorical, pedagogical, and computational principles of Creating Intelligent Content with Lightweight DITA view and perceive LwDITA topics as code.
zh_cn: 专业的写作工具拥有“所见即所得”的功能，可以隐藏代码，但是本书中的修辞、教学和计算机原则会将 LwDITA 话题视为代码来对待。

source: Professionals already using DITA to create and architect content most likely learned about the standard in training sessions that emphasized the semantic benefits of the several document and element types in DITA 1.3.
zh_cn: 已经在使用 DITA 创建和构造内容的专业人员很可能在培训时就已经了解了 LwDITA，培训会强调 DITA 标准1.3版本中几种文档和元素类型语义优势。

source: Professors would benefit from knowledge applied in their courses and research projects, and practitioners operated under the idea that professors had something important to tell.
zh_cn: 教授能从运用于课程和研究项目中的知识中获益，而从业者依从专家专长的构想展开业务

source: Prolog: contains information about a file, for example, author information or subject category.
zh_cn: 序言（prolog）：包含有关文件的信息，如作者信息或主题类别。

source: Properly tagged DITA topics can create or join content collections ready for reuse of material, single-sourcing of whole topics or their elements, and filters as determined by a deliverable's audience or context.
zh_cn: 适当标签化的 DITA 话题可以用于创建或连接内容集合，以便复用资源、完整的同源话题或同源话题包含的各个元素，以及由交付物的受众或语境决定的过滤器。

source: Providing a detailed explanation or tutorial of the content and element types included in DITA 1.3 is way beyond the scope of Creating Intelligent Content with Lightweight DITA.
zh_cn: 提供DITA 1.3 中包含的内容和元素类型的详细解释或教程已经超出了使用轻量级DITA创建智能内容的范围

source: Publication (More than Presentation).
zh_cn: 发布（不仅仅是呈现内容），

source: Publications from the 2000s heralded that “technical communicators will probably face a day when all organizational documents are saved in XML format” (Sapienza, 2002, p.
zh_cn: 2000年代的出版物就预言 “技术传播工程师可能会迎来所有组织性的文档都保存在 XML 里的一天”（萨皮恩扎， 2002年，第

source: Published in 1983, PQTI was credited to Morris Dean and a long list of co-authors (or co- “preparers”) and focused on a list of requirements of quality, presented under the principle of “technical information that meets all the requirements is quality information” (Dean et al., 1983, p.
zh_cn: PQTI1983年首次面世，归功于莫里斯·迪恩以及一大批合著者，重点关注质量要求列表，并秉持“满足所有要求的技术信息是才是高质量信息”的原则” (Dean et al., 1983, p.

source: Pure XML (as we saw in the marinara sauce example) does not provide a defined set of tags, but DITA does offer a catalog of elements and attributes relevant for technical communicators.
zh_cn: 纯 XML（如意式番茄罗勒酱菜谱示例所示）不会提供已经定义好的标签，但是 DITA 提供了一系列与技术传播相关的元素和属性。

source: Putting the Manual on Life Support
zh_cn: 手册日薄西山

source: REVISITING THE FUTURE OF TECHNICAL COMMUNICATION
zh_cn: 重新讨论技术传播的未来

source: Rather, I'm suggesting that evolution is a model of change more general than either biology or language, one that applies equally but differently to both” (2015, p.
zh_cn: 相反，我想说的是，进化是一种变化的模式，比生物学或语言都更加普遍，可以平等地用在生物学或语言身上，但意义又有所不同”（2015年，

source: Rather, I’m suggesting that evolution is a model of change more general than either biology or language, one that applies equally but differently to both” (2015, p.
zh_cn: 相反，我想说的是，进化是一种变化的模式，比生物学或语言都更加普遍，可以平等地用在生物学或语言身上，但意义又有所不同”（2015年，

source: Rather, there is a recipe for milkshakes that instructs you to add ice cream, milk and fruit of your choice.
zh_cn: 相反，会有一份奶昔食谱教你用冰淇淋、牛奶和你所选择的那款水果制作奶昔。

source: Recent models have proposed less linear and more iterative frameworks that focus on developing and implementing a recursive and overall content strategy.
zh_cn: 最近的模型提出了更多的可迭代框架，这些框架关注于开发、实现可以不断发展的全面的内容策略，而线性框架已经越来越少。

source: Reducing the amount of reading and other passive activity in training
zh_cn: 减少培训中所需的阅读量和其他被动活动

source: Redundantly, both elements should contain the same information in order to comply with syntax rules from HTML5 and LwDITA.
zh_cn: 不过冗余的是，为了符合 HTML5 和 LwDITA 的语法规则，两个元素应该包含相同的信息。

source: Reference: describes commands, parameters, and other features (Pringle & O'Keefe, 2009, p.
zh_cn: 参考（reference）：描述命令、参数和其他特性（普林格尔和奥基夫，2009年，第

source: References
zh_cn: 参考

source: Researchers work with practitioners that include community partners, government officials, and medics.
zh_cn: 研究人员与包括社区合作伙伴、政府官员和医疗人员在内的众多从业者合作。

source: Retrievability
zh_cn: 可检索

source: Reusable content uses “existing modular content components to develop new content products.” In a word processing environment, an author can use copy and paste functions, but those eventually reach manual limitations.
zh_cn: 可复用内容使用“现有的模块化内容组件来开发新的内容产品”。在文字处理器中，作者可以使用复制和粘贴功能，但最终会受到人工操作的限制。智能内容中的复用是自动化的，可以在交付内容和模块之间保持一致性，同时还简化了转换过程（并减低了与之相关的成本）。

source: Reuse in intelligent content is automated and provides consistency across deliverables and sections, while also simplifying translation processes (and costs associated with them).
zh_cn: 智能内容中的复用是自动化的，可以在交付内容和模块之间保持一致性，同时还简化了转换过程（并减低了与之相关的成本）。

source: Revise it.
zh_cn: 修改

source: Revisiting the DITA Map
zh_cn: 重新讨论 DITA 地图

source: Rhetorical effectiveness establishes successful context and also helps to envision the future of a content repository.
zh_cn: 修辞效果建立了有效的上下文信息，也有助于展望内容存储库的未来。

source: Rhetorical effectiveness plays an important role in the application of LwDITA as an agent of intelligent content.
zh_cn: LwDITA 是创建智能内容的媒介，而修辞效果在 LwDITA 的应用中扮演着重要角色。

source: Rigo closed this section stating that the “manual must then include a reference chart showing all command formats on a single page” (1976, p.
zh_cn: 里戈在这一节的末尾称“手册必须包含一个在单个页面上显示所有命令格式的参考图表”(1976, p.

source: Rigo concluded his ode to the appendix with the following: “Appendices are great.
zh_cn: Rigo在对附录的赞歌中总结道:“附录太棒了。

source: Rigo's outline was “designed mainly for a software vendor or equivalent system application.
zh_cn: 里戈的大纲“主要是为软件供应商或等效系统应用设计的。

source: Rigo's proposed sections and moves establish a clear pattern or schema for composing an example of the technical manual as a genre of technical communication.
zh_cn: 里戈建议的分节和文步构建了清晰的模式或者说是架构，能利用它来构成技术手册的范例以此作为技术传播的体裁。

source: Rockley & Gollner's portrayal of content automation subject to human thinking structures bears resemblance to the model of computational thinking by Jeannette Wing that I mentioned in Chapter 1.
zh_cn: 罗克利和戈尔纳对受制于人类思维结构的内容自动化的描述，与我在第一章中提到的珍妮特·温的计算思维模型有相似之处。

source: Rockley & Gollner, writing about intelligent content as a key step in developing a sustainable content strategy, mention that:
zh_cn: 罗克利和戈尔纳（Gollner）认为智能内容是发展可持续内容战略的关键一步，他们指出：

source: Ross summarizes the discussion by suggesting that topics are shared places common to all debate, which allow rhetors to shape viable argument, and that is where the rhetorical concept of topic meets the DITA topic.
zh_cn: 罗斯对这些讨论进行了总结，表示话题是所有辩论所共有的，演说家可以据此形成可行论据，这也是修辞中的主题概念与DITA主题的交汇之处。

source: Roundabout Expressions
zh_cn: 迂回表达

source: Sample output.
zh_cn: 样例输出.

source: Scholars in writing programs and technical communication are positioned to conduct research in the intersection of computational thinking and content in ways that most computing professionals simply are not prepared or motivated to explore.
zh_cn: 写作和技术传播领域的学者们的目标是研究计算机思维和内容发开的交叉点，这是大多数计算机专业人士根本没有打算或没有动力去探索的。

source: Section: an organizational division within a topic.
zh_cn: 节（section）：话题里结构分明的一部分，

source: Semantically rich content includes “added extra, machine-readable information that describes what the content is, what it's about, and more.” This layer of metadata can specify the type of audience, platform (or cuisine, if we look back at the marinara sauce example from Chapter 1) for a whole topic of information or for specific paragraph or phrase level elements in that topic (Rockley et al., 2015, pp.
zh_cn: 语义丰富的内容包括“额外的机器可读信息，用以描述内容详情”。这一层元数据可以指定整个话题信息，或话题信息中的特定段落或短语级元素的受众类型、平台类型（菜谱类型，如第一章中意式番茄罗勒酱的例子）(Rockley et al., 2015, pp.

source: Separate what to do from what it means
zh_cn: 分离含义与步骤

source: She adds that “thinking like a computer scientist means more than being able to program a computer.
zh_cn: 她补充说：“像计算机科学家一样思考不仅仅意味着能够编写程序，

source: She defined elements as “the units that physically make up technical information.
zh_cn: 她将元素定义为“构成技术信息的实体单位”。

source: She points out that “most people don't want to be a computer scientist, but everyone can use computers as an extension of our minds, to experience the world and create things that matter to us” (Barba, 2016).
zh_cn: 她指出，“大多数人并不想成为计算机科学家，但每个人都可以使用计算机拓展思维，体验世界，创造对我们来说重要的东西” (Barba, 2016)。

source: She provides potential automated outcomes such as extracting questions and answers from the webinar transcription and turning them into blog
zh_cn: 罗克利提供了可能的自动化成果，如从网络研讨会转录文本提取问题和答案，编写为博客，

source: Short description
zh_cn: 简短描述组件

source: Short description: the purpose or main point of a topic.
zh_cn: 简短描述（shoort description）：描述话题的目的或要点。

source: Short, succinct manuals allow the user to dive into many different tasks and to accomplish them quickly, thereby gaining a sense of control and autonomy that inspires further learning.
zh_cn: 简短、简洁的手册能让用户深入并迅速完成不同的任务，从何获得掌控感和自觉性以激发进一步的学习。

source: Should contain “at least one complete example.” “Do not try to show off every bell and whistle in the system in a single example.
zh_cn: 应该包含“至少一个完整的示例。”“不要试图在一个案例中展现系统所有花里胡哨的功能。”

source: Should contain “little more than an annotated listing from a typical run.” Rigo specified that this “section does not have to explain everything” (1976, p.
zh_cn: “只应包括典型运行场景下的注释清单。”里戈特别指出“这一节不需要包罗万象。” (1976, p.

source: Should contain “step-by-step instructions for performing a task of primary interest to the user.
zh_cn: 应该包含“逐步指导”引导用户完成最感兴趣的任务。

source: Should describe “all statements, commands, parameters, and options that a user must cope with” (1976, p.
zh_cn: 应该描述“用户必须处理的所有语句、命令、参数和选项。”(1976, p.

source: Should describe “the program or system as it will appear to the user.
zh_cn: 应该描述“程序或系统呈现在用户眼前的形态。”

source: Should identify the system by name and state its purpose, intended audience (“by job title or profession”) or special training prerequisites, hardware and software requirements, “(c)opyright restrictions, address for questions and comments, list of other directly relevant publications, etc.” “None of these topics should extend beyond a single short paragraph.
zh_cn: 应该做到靠名称就能识别系统、描述手册的目的及目标受众（“通过职称或职业”）或特殊的培训条件、软硬件要求，“版权限制、问答模块、直接相关出版物列表等。”“这些话题都至多在一短段中穷尽。

source: Should include a table of contents and an index.
zh_cn: 应该包括一个目录和一个索引。

source: Should include “any information that the user needs to determine whether he can run the system in his installation or use it for his application.
zh_cn: 应当包括“所有用户所需的信息，用户能够利用这些信息确定自己能够在安装后运行系统或正常使用应用”

source: Similar to the generic topic from Figure 2.2, the task's first line of code announces to the computing processors that the topic is an XML file and should be treated as such.
zh_cn: 与图2.2中的通用主题类似，该任务的第一行代码告知计算机处理器该主题是一个XML文件，应该按XML文件处理。

source: Similarly, to some extent, we understand the idea of a commonplace without much prompting: A commonplace idea is one which is, quite literally, common to a particular place.
zh_cn: 同样地，在某种程度上，我们无需太多提示就能理解常规这个概念：从字面上讲，常规指的是在某个特定领域的常见现象。

source: Simplification.
zh_cn: 简洁、

source: So, how does John Carroll plead when confronted with the claim of DITA ancestry?
zh_cn: 因此，当面临“DITA的创世主”这一指控时，她是如何辩解的呢？

source: Software developers who want to contribute to DITA-based product documentation without using an XML editor
zh_cn: 希望不借助XML编辑器为基于DITA的文档做出贡献的软件开发人员

source: Software developers who want to contribute to documentation using HTML-authoring tools
zh_cn: 希望使用HTML创作工具为文档做出贡献的软件开发人员

source: Some alternatives briefly considered were acronyms like CAKE (Content Authoring for the Knowledge Ecosystem), PAF (Portable Authoring Framework), XFAS (Cross-format Authoring Specification), or a one-word evocative name, like Helium, Portable, Adapt, or Evolve.
zh_cn: 一些简单考虑过的替代方案是使用首字母缩略词，如 CAKE（Content Authoring for the Knowledge Ecosystem）、PAF（Portable Authoring Framework）、XFAS（Cross-format Authoring Specification），或者可以引起共鸣的一个单词长度的名字，如 Helium、Portable、Adapt 或 Evolve。

source: Some can be handled with a single sentence.
zh_cn: 一些甚至可以用一句话解决。

source: Some components are self- explanatory, but others require a definition.
zh_cn: 有些组件是无需定义的，但还有些组件需要用户定义。

source: Some computing professionals will argue that the abstractions in computational thinking are mainly related to algorithms.
zh_cn: 一些计算机领域的专业人士认为，计算机思维的抽象概念主要与算法有关，

source: Some current DITA users may find XDITA to be appropriate, but the XDITA authoring format of LwDITA is primarily aimed at content creators who either do not know about DITA or perceive the standard as too robust for their information needs.
zh_cn: 一些DITA用户可能认为XDITA十分合适，但是LwDITA的XDITA创作格式主要针对的是那些不了解DITA或认为该标准对于他们的信息需求过于健壮的内容创建者。

source: Some experience with HTML or Markdown would also help, but the book provides enough context and information about those languages to understand and use the LwDITA proposed standard.
zh_cn: 如果读者具有使用 HTML 或 Markdown 的经验会有所帮助，但是本书对这些语言提供了足够的上下文和信息，以便帮助读者理解和使用 LwDITA 拟议标准。

source: Some helpful titles that thoroughly describe and explain the standard have already been published (Hackos, 2011; Bellamy et al., 2012).
zh_cn: 一些详细描述和解释该标准的书已经出版 (Hackos, 2011; Bellamy et al., 2012).

source: Some members of the subcommittee focused on researching the compatibility and exchange among the three authoring formats and the DITA 1.3 standard.
zh_cn: 小组委员会的一些成员主要研究三种写作格式和 DITA 标准1.3版本之间的兼容性和转换能力。

source: Some of Dean et al.'s recommendations reflected major changes for documentation from that period.
zh_cn: 迪恩等人的建议反映了文档在这一时期发生的主要变化。

source: Some of Hart-Davidson's work has focused on that overlap of the topic as content unit and the topic as commonplace element (Hart-Davidson & Omizo, 2017).
zh_cn: 哈特-戴维森的一些工作集中在主题作为内容单元和常规元素的重叠上(Hart-Davidson & Omizo, 2017).

source: Some of Price's recommendations transcended to the third kind of rhetorical convention proposed by Miller and Selzer, as they became disciplinary moves or commonplaces.
zh_cn: 普莱斯提出的一些建议成为了金科玉律或者说是规绳矩墨，已然超越了米勒和塞尔泽提倡的第三种修辞惯例。

source: Some of my students call the Oxygen validation error notifier the “red squiggly of doom” (Figure 6.2).
zh_cn: 我的一些学生称 Oxygen 验证错误提示是“预示着坏消息的红色曲线”（图6.2）。

source: Some of the early conversations during the Lightweight DITA subcommittee calls included selecting the right name for the proposed standard.
zh_cn: 轻量级 DITA 小组委员会早期的讨论包括内容为提议的标准起一个合适的名字。

source: Some of these sub-elements
zh_cn: 其中一些子元素

source: Some of those applications were based around the needs of authors (e.g., creating marketing content, writing pharmaceutical information, or structuring books for a publishing house) who had no experience with XML.
zh_cn: 其中一些应用场景是基于没有 XML 写作经验的创作者的需求而提出的（如创建营销内容、编写药品信息或在出版社编辑结构化图书）。

source: Some of those original element types are now deprecated, but the specification for DITA 1.0, edited by Michael Priestley and JoAnn Hackos, included the following elements and categories:
zh_cn: 其中一些原始的元素类型现在已经过时了，但是由迈克尔·普里斯特利和乔安·哈克斯编辑的DITA 1.0规范包含了以下元素和类别：

source: Some technical communication practitioners share that opinion (Baker, 2016).
zh_cn: 部分技术传播从业者也同意这一观点 (Baker, 2016)。

source: Someone mentioned structured authoring with XML and that caught Chef Pedro's attention.
zh_cn: 有人提到可以使用 XML 进行结构化创作，这引起了佩德罗的注意。

source: Sometimes a basic topic with a title and a couple of paragraphs is all a content situation requires.
zh_cn: 有时，一个基本话题加上一个标题和几个段落就是撰写内容所需要的全部组件。

source: Source: a link to media resources of audio or video content.
zh_cn: 来源（source）：音频或视频等媒体资源的链接。

source: Staging: explaining conditions necessary to begin
zh_cn: 筹划：解释开始所需条件

source: Staging: explaining the goal to be achieved
zh_cn: 筹划：解释要实现的目标

source: Statement of purpose: To develop a specification for a lightweight DITA architecture that can ease implementation by vendors and adoption by users.
zh_cn: 目的声明：开发一个轻量级 DITA 体系结构规范，以方便供应商和用户使用，

source: Strong, Precise Verbs
zh_cn: 强而精确的动词

source: Structure purists
zh_cn: 追求结构化

source: Structured content is “designed to be both human and machine readable.” Enablers of that kind of dual readability are the behind-the-scenes labels and notes (i.e., tags and attributes) that made the formula of content + code result in a data source.
zh_cn: 结构化内容“甫一设计就决定既要适合人读，也要适合机读”。实现这种双重可读性的是隐藏在背后的标记和注释（例如标签和属性），使内容和代码结合起来产生一个数据源。

source: Structuring Intelligent Content with LwDITA
zh_cn: 使用 LwDITA 生成结构化智能内容

source: Students break problems into component parts, extract key information, and develop descriptive models to understand complex systems or facilitate problem-solving.
zh_cn: 学生能够将拆解问题，提取关键信息，建立描述性模型来理解复杂系统或促进问题解决。

source: Students collect data or identify relevant data sets, use digital tools to analyze them, and represent data in various ways to facilitate problemsolving and decision-making.
zh_cn: 学生能够收集数据或识别相关数据集，使用数字工具进行分析，并以各种方式表示数据，促进问题解决，进行决策。

source: Students formulate problem definitions suited for technology-assisted methods such as data analysis, abstract models and algorithmic thinking in exploring and finding solutions.
zh_cn: 学生能够定义问题，通过数据分析、抽象模型和算法思维等科技手段的辅助，探索和寻找解决方案。

source: Students in Professional and Technical Writing courses from the Virginia Tech Department of English have fun creating
zh_cn: 来自弗吉尼亚理工学院英语专业的学生在专业技术写作课上使用LwDITA风格创作内容时觉得很有趣味性

source: Students understand how automation works and use algorithmic thinking to develop a sequence of steps to create and test automated solutions (ISTE, 2018).
zh_cn: 学生能够理解自动化工作原理，使用算法思维开发步骤严密的程序，制定和测试自动化解决方案 (ISTE, 2018)。

source: Style.
zh_cn: 风格

source: Subscript
zh_cn: 下标

source: Subscript, which is a letter, number, or figure that is printed lower than the line.
zh_cn: 下标（subscript），即比所在行位置略低的一个字母、数字或图形，

source: Such teaching should engage novices in information practices where they learn to perceive practices of computer technology as directly involved in the provision of patient care” (Musaeus et al., 2017, p.
zh_cn: 应该让新手医生参与到信息实践中来，让他们知道计算机技术实践可以直接为患者提供护理服务”(Musaeus et al., 2017, p.

source: Superscript
zh_cn: 上标

source: Superscript, which is a letter, number, or figure that is printed above than the line.
zh_cn: 上标（superscript），即比所在行位置略高的一个字母、数字或图形，

source: Supplemental.
zh_cn: 补充材料.

source: Sushi brochure map.
zh_cn: 交付物。
